cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xb.svd
        <!-- REGISTER "ELVR1" -->
        <register>
          <name>ELVR1</name>
          <description>External Interrupt Factor Level Register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LB31" -->
            <field>
              <name>LB31</name>
              <description>Bit31 of ELVR1</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA31" -->
            <field>
              <name>LA31</name>
              <description>Bit30 of ELVR1</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB30" -->
            <field>
              <name>LB30</name>
              <description>Bit29 of ELVR1</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA30" -->
            <field>
              <name>LA30</name>
              <description>Bit28 of ELVR1</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB29" -->
            <field>
              <name>LB29</name>
              <description>Bit27 of ELVR1</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA29" -->
            <field>
              <name>LA29</name>
              <description>Bit26 of ELVR1</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB28" -->
            <field>
              <name>LB28</name>
              <description>Bit25 of ELVR1</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA28" -->
            <field>
              <name>LA28</name>
              <description>Bit24 of ELVR1</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB27" -->
            <field>
              <name>LB27</name>
              <description>Bit23 of ELVR1</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA27" -->
            <field>
              <name>LA27</name>
              <description>Bit22 of ELVR1</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB26" -->
            <field>
              <name>LB26</name>
              <description>Bit21 of ELVR1</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA26" -->
            <field>
              <name>LA26</name>
              <description>Bit20 of ELVR1</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB25" -->
            <field>
              <name>LB25</name>
              <description>Bit19 of ELVR1</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA25" -->
            <field>
              <name>LA25</name>
              <description>Bit18 of ELVR1</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB24" -->
            <field>
              <name>LB24</name>
              <description>Bit17 of ELVR1</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA24" -->
            <field>
              <name>LA24</name>
              <description>Bit16 of ELVR1</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB23" -->
            <field>
              <name>LB23</name>
              <description>Bit15 of ELVR1</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA23" -->
            <field>
              <name>LA23</name>
              <description>Bit14 of ELVR1</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB22" -->
            <field>
              <name>LB22</name>
              <description>Bit13 of ELVR1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA22" -->
            <field>
              <name>LA22</name>
              <description>Bit12 of ELVR1</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB21" -->
            <field>
              <name>LB21</name>
              <description>Bit11 of ELVR1</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA21" -->
            <field>
              <name>LA21</name>
              <description>Bit10 of ELVR1</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB20" -->
            <field>
              <name>LB20</name>
              <description>Bit9 of ELVR1</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA20" -->
            <field>
              <name>LA20</name>
              <description>Bit8 of ELVR1</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB19" -->
            <field>
              <name>LB19</name>
              <description>Bit7 of ELVR1</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA19" -->
            <field>
              <name>LA19</name>
              <description>Bit6 of ELVR1</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB18" -->
            <field>
              <name>LB18</name>
              <description>Bit5 of ELVR1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA18" -->
            <field>
              <name>LA18</name>
              <description>Bit4 of ELVR1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB17" -->
            <field>
              <name>LB17</name>
              <description>Bit3 of ELVR1</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA17" -->
            <field>
              <name>LA17</name>
              <description>Bit2 of ELVR1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB16" -->
            <field>
              <name>LB16</name>
              <description>Bit1 of ELVR1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA16" -->
            <field>
              <name>LA16</name>
              <description>Bit0 of ELVR1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMIRR" -->
        <register>
          <name>NMIRR</name>
          <description>Non Maskable Interrupt Factor Register</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NR" -->
            <field>
              <name>NR</name>
              <description>NMI interrupt request detection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMICL" -->
        <register>
          <name>NMICL</name>
          <description>Non Maskable Interrupt Factor Clear Register</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0001</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NCL" -->
            <field>
              <name>NCL</name>
              <description>NMI interrupt factor clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ELVR2" -->
        <register>
          <name>ELVR2</name>
          <description>External Interrupt Factor Level Register 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LC31" -->
            <field>
              <name>LC31</name>
              <description>Bit31 of External interrupt request detection level selection bits</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC30" -->
            <field>
              <name>LC30</name>
              <description>Bit30 of External interrupt request detection level selection bits</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC29" -->
            <field>
              <name>LC29</name>
              <description>Bit29 of External interrupt request detection level selection bits</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC28" -->
            <field>
              <name>LC28</name>
              <description>Bit28 of External interrupt request detection level selection bits</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC27" -->
            <field>
              <name>LC27</name>
              <description>Bit27 of External interrupt request detection level selection bits</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC26" -->
            <field>
              <name>LC26</name>
              <description>Bit26 of External interrupt request detection level selection bits</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC25" -->
            <field>
              <name>LC25</name>
              <description>Bit25 of External interrupt request detection level selection bits</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC24" -->
            <field>
              <name>LC24</name>
              <description>Bit24 of External interrupt request detection level selection bits</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC23" -->
            <field>
              <name>LC23</name>
              <description>Bit23 of External interrupt request detection level selection bits</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC22" -->
            <field>
              <name>LC22</name>
              <description>Bit22 of External interrupt request detection level selection bits</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC21" -->
            <field>
              <name>LC21</name>
              <description>Bit21 of External interrupt request detection level selection bits</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC20" -->
            <field>
              <name>LC20</name>
              <description>Bit20 of External interrupt request detection level selection bits</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC19" -->
            <field>
              <name>LC19</name>
              <description>Bit19 of External interrupt request detection level selection bits</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC18" -->
            <field>
              <name>LC18</name>
              <description>Bit18 of External interrupt request detection level selection bits</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC17" -->
            <field>
              <name>LC17</name>
              <description>Bit17 of External interrupt request detection level selection bits</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC16" -->
            <field>
              <name>LC16</name>
              <description>Bit16 of External interrupt request detection level selection bits</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC15" -->
            <field>
              <name>LC15</name>
              <description>Bit15 of External interrupt request detection level selection bits</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC14" -->
            <field>
              <name>LC14</name>
              <description>Bit14 of External interrupt request detection level selection bits</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC13" -->
            <field>
              <name>LC13</name>
              <description>Bit13 of External interrupt request detection level selection bits</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC12" -->
            <field>
              <name>LC12</name>
              <description>Bit12 of External interrupt request detection level selection bits</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC11" -->
            <field>
              <name>LC11</name>
              <description>Bit11 of External interrupt request detection level selection bits</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC10" -->
            <field>
              <name>LC10</name>
              <description>Bit10 of External interrupt request detection level selection bits</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC9" -->
            <field>
              <name>LC9</name>
              <description>Bit9 of External interrupt request detection level selection bits</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC8" -->
            <field>
              <name>LC8</name>
              <description>Bit8 of External interrupt request detection level selection bits</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC7" -->
            <field>
              <name>LC7</name>
              <description>Bit7 of External interrupt request detection level selection bits</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC6" -->
            <field>
              <name>LC6</name>
              <description>Bit6 of External interrupt request detection level selection bits</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC5" -->
            <field>
              <name>LC5</name>
              <description>Bit5 of External interrupt request detection level selection bits</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC4" -->
            <field>
              <name>LC4</name>
              <description>Bit4 of External interrupt request detection level selection bits</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC3" -->
            <field>
              <name>LC3</name>
              <description>Bit3 of External interrupt request detection level selection bits</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC2" -->
            <field>
              <name>LC2</name>
              <description>Bit2 of External interrupt request detection level selection bits</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC1" -->
            <field>
              <name>LC1</name>
              <description>Bit1 of External interrupt request detection level selection bits</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LC0" -->
            <field>
              <name>LC0</name>
              <description>Bit0 of External interrupt request detection level selection bits</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMIENR" -->
        <register>
          <name>NMIENR</name>
          <description>Non Maskable Interrupt Enable Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NE0" -->
            <field>
              <name>NE0</name>
              <description>NMI enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
