cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xb.svd
        <!-- REGISTER "IRQ03MON" -->
        <register>
          <name>IRQ03MON</name>
          <description>IRQ03 Batch Read Register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ03</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ03</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ03</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ04MON" -->
        <register>
          <name>IRQ04MON</name>
          <description>IRQ04 Batch Read Register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ04</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ04</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ04</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ05MON" -->
        <register>
          <name>IRQ05MON</name>
          <description>IRQ05 Batch Read Register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ05</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ05</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ05</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ06MON" -->
        <register>
          <name>IRQ06MON</name>
          <description>IRQ06 Batch Read Register</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ06</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ06</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ06</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ07MON" -->
        <register>
          <name>IRQ07MON</name>
          <description>IRQ07 Batch Read Register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ07</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ07</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ07</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ08MON" -->
        <register>
          <name>IRQ08MON</name>
          <description>IRQ08 Batch Read Register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ08</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ08</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ08</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ09MON" -->
        <register>
          <name>IRQ09MON</name>
          <description>IRQ09 Batch Read Register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ09</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ09</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ09</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ10MON" -->
        <register>
          <name>IRQ10MON</name>
          <description>IRQ10 Batch Read Register</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ10</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ10</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ10</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
