cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xb.svd
        <!-- REGISTER "IRQ19MON" -->
        <register>
          <name>IRQ19MON</name>
          <description>IRQ19 Batch Read Register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ19</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ19</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ19</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ20MON" -->
        <register>
          <name>IRQ20MON</name>
          <description>IRQ20 Batch Read Register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ20</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ20</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ20</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ21MON" -->
        <register>
          <name>IRQ21MON</name>
          <description>IRQ21 Batch Read Register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ21</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ21</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ21</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ22MON" -->
        <register>
          <name>IRQ22MON</name>
          <description>IRQ22 Batch Read Register</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ22</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ22</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ22</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ23MON" -->
        <register>
          <name>IRQ23MON</name>
          <description>IRQ23 Batch Read Register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ23</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ23</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ23</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
