cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xb.svd
        <!-- REGISTER "I2C_FBYTE2" -->
        <register>
          <name>I2C_FBYTE2</name>
          <description>FIFO Byte Register 2</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FD" -->
            <field>
              <name>FD</name>
              <description>data count in FIFO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_EIBCR" -->
        <register>
          <name>I2C_EIBCR</name>
          <description>Extension I2C Bus Control Register</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDAS" -->
            <field>
              <name>SDAS</name>
              <description>SDA status bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCLS" -->
            <field>
              <name>SCLS</name>
              <description>SCL status bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDAC" -->
            <field>
              <name>SDAC</name>
              <description>SDA output control bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLC" -->
            <field>
              <name>SCLC</name>
              <description>SCL output control bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOCE" -->
            <field>
              <name>SOCE</name>
              <description>Serial output enabled bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description>Bus error control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2S_SMR" -->
        <register>
          <name>I2S_SMR</name>
          <description>Serial Mode Register</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xEF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>Oeration mode set bits</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDS" -->
            <field>
              <name>BDS</name>
              <description>Transfer direction select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOE" -->
            <field>
              <name>SOE</name>
              <description>Serial data output enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2S_SCR" -->
        <register>
          <name>I2S_SCR</name>
          <description>Serial Control Register</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCL" -->
            <field>
              <name>UPCL</name>
              <description>Programmable clear bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MS" -->
            <field>
              <name>MS</name>
              <description>Master/Slave function select bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description>Received interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXE" -->
            <field>
              <name>RXE</name>
              <description>Data received enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXE" -->
            <field>
              <name>TXE</name>
              <description>Data transmission enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2S_ESCR" -->
        <register>
          <name>I2S_ESCR</name>
          <description>Extended Communication Control Register</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xC7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SOP" -->
            <field>
              <name>SOP</name>
              <description>Serial output pin set bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "L3" -->
            <field>
              <name>L3</name>
              <description>Data length select bit 3</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "L" -->
            <field>
              <name>L</name>
              <description>Data length select bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2S_SSR" -->
        <register>
          <name>I2S_SSR</name>
          <description>Serial Status Register</description>
          <alternateGroup>I2S</alternateGroup>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x02</resetValue>
          <resetMask>0x9E</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REC" -->
            <field>
              <name>REC</name>
              <description>Received error flag clear bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AWC" -->
            <field>
              <name>AWC</name>
              <description>FIFO access width set</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ORE" -->
            <field>
              <name>ORE</name>
              <description>Overrun error flag bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDRF" -->
            <field>
              <name>RDRF</name>
              <description>Received data full flag bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TDRE" -->
            <field>
              <name>TDRE</name>
              <description>Transmit data empty flag bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
