cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xb.svd
        <!-- REGISTER "CKEN1" -->
        <register>
          <name>CKEN1</name>
          <description>Peripheral Function Clock Control Register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0F0F</resetValue>
          <resetMask>0x000F0F0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QDUCK" -->
            <field>
              <name>QDUCK</name>
              <description>Settings for operation clock supply and gating of quad counters</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTCK" -->
            <field>
              <name>MFTCK</name>
              <description>Settings for operation clock supply and gating of multi-function timer and PPG</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMCK" -->
            <field>
              <name>BTMCK</name>
              <description>Settings operation clock supply and gating to base timers</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MRST1" -->
        <register>
          <name>MRST1</name>
          <description>Peripheral Function Reset Control Register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0F0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QDURST" -->
            <field>
              <name>QDURST</name>
              <description>Reset control of quad counters</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTRST" -->
            <field>
              <name>MFTRST</name>
              <description>Control of multi-function timer and PPG reset control</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMRST" -->
            <field>
              <name>BTMRST</name>
              <description>Reset control of base timers</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CKEN2" -->
        <register>
          <name>CKEN2</name>
          <description>Peripheral Function Clock Control Register 2</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0015F400</resetValue>
          <resetMask>0x0015F403</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PCRCCK" -->
            <field>
              <name>PCRCCK</name>
              <description>Settings for clock supply and gating to Programmable-CRC</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CECCK" -->
            <field>
              <name>CECCK</name>
              <description>Settings for clock supply and gating of HDMI-CEC/Remote Control Reception</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LCDCCK" -->
            <field>
              <name>LCDCCK</name>
              <description>Settings for clock supply and gating to LCD Controller</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SCCK" -->
            <field>
              <name>I2SCCK</name>
              <description>Settings for clock supply and gating of MFSI2S</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICCCK" -->
            <field>
              <name>ICCCK</name>
              <description>Settings for clock supply and gating of IC-Card Interface</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AESCK" -->
            <field>
              <name>AESCK</name>
              <description>Settings for clock supply and gating to AES</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANCK" -->
            <field>
              <name>CANCK</name>
              <description>Settings for clock supply and gating to CAN controller</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USBCK" -->
            <field>
              <name>USBCK</name>
              <description>Settings for clock supply and gating of USB</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MRST2" -->
        <register>
          <name>MRST2</name>
          <description>Peripheral Function Reset Control Register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0015F433</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PCRCRST" -->
            <field>
              <name>PCRCRST</name>
              <description>Reset control of Programmable-CRC</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CECRST" -->
            <field>
              <name>CECRST</name>
              <description>Reset control of HDMI-CEC/Remote Control Reception</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LCDCRST" -->
            <field>
              <name>LCDCRST</name>
              <description>Reset control of LCD Controller</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SCRST" -->
            <field>
              <name>I2SCRST</name>
              <description>Reset control of MFSI2S</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICCRST" -->
            <field>
              <name>ICCRST</name>
              <description>Reset control of IC-Card Interface</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AESRST" -->
            <field>
              <name>AESRST</name>
              <description>Reset control of AES</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANRST" -->
            <field>
              <name>CANRST</name>
              <description>Reset control of CAN controller</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBRST" -->
            <field>
              <name>USBRST</name>
              <description>Reset control of USB</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
