cmsis-svd/cmsis-svd/data/Infineon/s6e1c1xb.svd
        <!-- REGISTER "DREQENB0" -->
        <register>
          <name>DREQENB0</name>
          <description>DMA request enable Register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DREQENB1" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB1</name>
          <description>DMA request enable Register 1</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "HWINT0" -->
        <register>
          <name>HWINT0</name>
          <description>Hardware transfer interrupt Register 0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "HWINT1" -->
        <register derivedFrom="HWINT0">
          <name>HWINT1</name>
          <description>Hardware transfer interrupt Register 1</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "HWINTCLR0" -->
        <register>
          <name>HWINTCLR0</name>
          <description>Hardware transfer interrupt clear Register 0</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "HWINTCLR1" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR1</name>
          <description>Hardware transfer interrupt clear Register 1</description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "DQMSK0" -->
        <register>
          <name>DQMSK0</name>
          <description>DMA request mask Register 0</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSK1" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK1</name>
          <description>DMA request mask Register 1</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR0" -->
        <register>
          <name>DQMSKCLR0</name>
          <description>DMA request mask clear Register 0</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSKCLR1" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR1</name>
          <description>DMA request mask clear Register 1</description>
          <addressOffset>0x94</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MTB_DWT" -->
    <peripheral>
      <name>MTB_DWT</name>
      <description>Micro Trace Buffer Data Watchpoint and Trace Registers</description>
      <version>A</version>
      <groupName>MTB_DWT</groupName>
      <baseAddress>0xF0001000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFD0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CMP_ADDR_START" -->
        <register>
          <name>CMP_ADDR_START</name>
          <description>MTB_DWT Address Compare Start trace Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCMP_STA" -->
            <field>
              <name>ADCMP_STA</name>
              <description>MTB_DWT address comparison start trace bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMP_DATA_START" -->
        <register>
          <name>CMP_DATA_START</name>
          <description>MTB_DWT Data Compare Start trace Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DTCMP_STA" -->
            <field>
              <name>DTCMP_STA</name>
              <description>MTB_DWT data comparison start trace bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMP_MASK_START" -->
        <register>
          <name>CMP_MASK_START</name>
          <description>MTB_DWT Mask Data Compare Start Trace Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSK_STA" -->
            <field>
              <name>MSK_STA</name>
              <description>MTB_DWT data compare start trace register mask bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMP_ADDR_STOP" -->
        <register>
          <name>CMP_ADDR_STOP</name>
          <description>MTB_DWT Address Compare Stop trace Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCMP_STO" -->
            <field>
              <name>ADCMP_STO</name>
              <description>MTB_DWT address comparison stop trace bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMP_DATA_STOP" -->
        <register>
          <name>CMP_DATA_STOP</name>
          <description>MTB_DWT Data Compare Stop trace Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DTCMP_STO" -->
            <field>
              <name>DTCMP_STO</name>
              <description>MTB_DWT data comparison stop trace bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CMP_MASK_STOP" -->
        <register>
          <name>CMP_MASK_STOP</name>
          <description>MTB_DWT Mask Data Compare Stop Trace Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSK_STO" -->
            <field>
              <name>MSK_STO</name>
              <description>MTB_DWT data compare stop trace register mask bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FCT" -->
        <register>
          <name>FCT</name>
          <description>MTB_DWT Function Register</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSTP" -->
            <field>
              <name>DSTP</name>
              <description>Data size stop bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSTA" -->
            <field>
              <name>DSTA</name>
              <description>Data size start bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STPEN" -->
            <field>
              <name>STPEN</name>
              <description>Enable MTB_DWT stop MTB function bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAEN" -->
            <field>
              <name>STAEN</name>
              <description>Enable MTB_DWT start MTB function bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PID4" -->
        <register>
          <name>PID4</name>
          <description>Peripheral ID4 Register</description>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PERID" -->
            <field>
              <name>PERID</name>
              <description>Peripheral ID bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PID5" -->
        <register>
          <name>PID5</name>
          <description>Peripheral ID5 Register</description>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PERID" -->
            <field>
              <name>PERID</name>
              <description>Peripheral ID bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PID6" -->
        <register>
          <name>PID6</name>
          <description>Peripheral ID6 Register</description>
          <addressOffset>0xFD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PERID" -->
            <field>
              <name>PERID</name>
              <description>Peripheral ID bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
